# GetLightShape Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
LightType..::..GetLightShape Method
LightType Class See Also
---
Return a copy of an object derived from LightShape
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public LightShape GetLightShape()
```

Visual Basic
---
```text
Public Function GetLightShape As LightShape
```

Visual C++
---
```text
public:
LightShape^ GetLightShape()
```

# See Also
LightType Class
Autodesk.Revit.DB.Lighting Namespace